# #1001
# #Дано чотири числа a , b , c , d
# a,b,c,d = map(float,input().split())
# result = a+b+c+d
# print(f"{result:.4f}")


#1002
#Знайти периметр прямокутника, якщо відомо дві його сторони а та б.
# a,b = map(int,input))
# P = (a+b) * 2
# print(P)


#1003
#Дано цілі числа х і у. В першому рядку вивести залишок від ділення пенршого числ на друге, а в другому залитшок від ділення на перше.
x,y = map(int,input().split())
res1 =x%y
res2 =y%x
print(res1)
print(res2)